In [5]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
hewan = DataFrame(np.arange(16).reshape(4,4),
                 columns = ['W','X','Y','Z'],
                 index=['Anjing','Kucing','Burung','Tikus'])
hewan

         W   X   Y   Z
Anjing   0   1   2   3
Kucing   4   5   6   7
Burung   8   9  10  11
Tikus   12  13  14  15

In [7]:
hewan.loc[1:2,['W','Y']] = np.nan
hewan

           W   X     Y   Z
Anjing   0.0   1   2.0   3
Kucing   NaN   5   NaN   7
Burung   8.0   9  10.0  11
Tikus   12.0  13  14.0  15

In [10]:
biasa_map = {'W':'baik','X':'buruk','Y':'baik','Z':'buruk'}

In [11]:
hewan_col = hewan.groupby(biasa_map,axis=1)
hewan_col.sum()

        baik  buruk
Anjing   2.0    4.0
Kucing   0.0   12.0
Burung  18.0   20.0
Tikus   26.0   28.0

In [12]:
biasa_series = Series(biasa_map)
biasa_series

W     baik
X    buruk
Y     baik
Z    buruk
dtype: object

In [14]:
hewan.groupby(biasa_series,axis=1).count()

        baik  buruk
Anjing     2      2
Kucing     0      2
Burung     2      2
Tikus      2      2

In [16]:
hewan

           W   X     Y   Z
Anjing   0.0   1   2.0   3
Kucing   NaN   5   NaN   7
Burung   8.0   9  10.0  11
Tikus   12.0  13  14.0  15

In [17]:
hewan.groupby(len).sum()

      W   X     Y   Z
5  12.0  13  14.0  15
6   8.0  15  12.0  21

In [18]:
hier_col = pd.MultiIndex.from_arrays([['MLG','MLG','MLG','SBY','SBY'],
                                     [1,2,3,1,2]],names=['City','sub_value'])

In [19]:
df_hr = DataFrame (np.arange(25).reshape(5,5),
                  columns=hier_col)

In [20]:
df_hr = df_hr * 100

In [21]:
df_hr

City        MLG               SBY
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400